package net.foxmediax.scriptfx.gui

object Documentation {
    val TEXT: String = """

ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ:

"checkpoint "x" "y" "z" "тип мира(обычный мир, незер или энд)" "радиус действия триггера(будет измеряться в блоках по всем осям, а в скрипт пишется числовое значение в количестве блоках)" - триггер который можно расположить по оси x, y, z и указать размер радиуса действия, чтобы когда игрок зашёл в радиус, триггер уже сработал.

"startscript "название скрипта" - запускает файл скрипта, также может быть использован после глобальной переменной "checkpoint".

"worldstartscript "название скрипта" - запускает файл скрипта во время того как игрок зашёл в мир.

"tp_allplayers "координаты по оси x, y, z" "тип мира" - телепортирует всех игроков в мире в определённые координаты и измерение.

"ticktime "(время в секундах, указывается по примеру "1.sec")" - даёт определённую задержку в продолжении скрипта, после истечении указанного времени, скрипт продолжает свою работу.

"stopscript" - завершает работу скрипта.

"contiune_startscript "название файла скрипта.kt" - запускает следующий указанный файл скрипта, работает только после глобальной переменной "stopscript".

"trigger_globalplay "указать тип действия" - срабатывает только в том случае, если: игрок попал в эндер мир и по этому мире уже летает эндер дракон(ender_dragon_fight); заспавнился босс-иссушитель(wither_boss_fight); игрок умер(player_death); игрок возрадился(player_respawn); игрок телепортировался(player_tp); игрок поел еду(player_eat); игрок взаимодействовал с определённыйм предметом(player_click "id предмета").

"weather "rain либо thunder" - срабатывает во время дождя или грозовой погоды.

"timecycles "day либо night, либо указать время в тиках" - срабатывает при наступлении определённого времени в игровом мире.
--------------------------------------------------------------------

ПЕРЕМЕННЫЕ:

print("писать сюда любой текст, и он отобразиться в чате") - присылает в чат определённый текст.

printNPC("писать сюда любой текст, и он отобразиться в чате, от имени НПС") "ID НПС", либо "никнейм" "цвет текста для ["никнейм, либо id нпс"]" (в чате пишется так: [имя нпс, либо никнейм] "текст") - присылает в чат определённый текст от имени НПС, либо от имени никнейма.

cameraINEffect "писать в секундах(1.sec)" - делает плавный эффект затухания в чёрный экран на определённое время, пока не произойдёт переменная "cameraOUTEffect" чёрный экран не пропадёт.

cameraOUTEffect - убирает чёрный экран, делает эффект появления, используется только если была перед этим использованная переменная "cameraINEffect".

cameraBIGText "большой текст по середине экрана" "время отображения в секундах(1.sec)" - показывает по середине экрана большой текст на определённое время.

cameraSMALLText "маленький текст по середине экрана" "время отображения в секундах(1.sec)" - показывает по середине экрана маленький текст на определённое время.

Если в конце переменной "cameraBIGText" добавить "+smalltext", и написать на следующей строке переменную "cameraSMALLText", то эти два текста отобразяться в одинаковое время и исчезнут также одинакого, и если было указано "+smalltext" в переменной "cameraBIGText", то в переменной "cameraSMALLText" время отображения можно не указывать.

startCommand("название команды(можно писать с /, а можно и без неё)") - выполняет определённую команду.
    """.trimIndent()
}